In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

In [3]:
dframe

   dataset1  dataset2 k1     k2
0  0.321673  0.003226  X  alpha
1 -0.324661 -0.424520  X   beta
2  0.061599  0.651864  Y  alpha
3 -1.138461  0.756867  Y   beta
4 -0.010357  1.120745  Z  alpha

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [5]:
group1.mean()

k1
X   -0.001494
Y   -0.538431
Z   -0.010357
Name: dataset1, dtype: float64

In [6]:


cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [9]:
group1 =  dframe['dataset1'].groupby([cities,month])
group1

In [11]:
group1.mean()

LA  FEB   -0.324661
    JAN    0.061599
NY  FEB   -1.138461
    JAN    0.155658
Name: dataset1, dtype: float64

In [14]:
dframe.groupby('k1')

In [12]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.001494 -0.210647
Y  -0.538431  0.704366
Z  -0.010357  1.120745

In [13]:


dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.321673  0.003226
   beta  -0.324661 -0.424520
Y  alpha  0.061599  0.651864
   beta  -1.138461  0.756867
Z  alpha -0.010357  1.120745

In [15]:
for name,group in dframe.groupby('k1'):
    print ("This is the %s group" %name)
    print (group)
    print ('\n')

This is the X group
   dataset1  dataset2 k1     k2
0  0.321673  0.003226  X  alpha
1 -0.324661 -0.424520  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  0.061599  0.651864  Y  alpha
3 -1.138461  0.756867  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4 -0.010357  1.120745  Z  alpha

In [16]:
for (k1,k2),group in dframe.groupby(['k1','k2']):
    print ("Key1 = %s, Key2 = %s" %(k1,k2))
    print (group)
    print ('\n')

Key1 = X, Key2 = alpha
   dataset1  dataset2 k1     k2
0  0.321673  0.003226  X  alpha


Key1 = X, Key2 = beta
   dataset1  dataset2 k1    k2
1 -0.324661  -0.42452  X  beta


Key1 = Y, Key2 = alpha
   dataset1  dataset2 k1     k2
2  0.061599  0.651864  Y  alpha


Key1 = Y, Key2 = beta
   dataset1  dataset2 k1    k2
3 -1.138461  0.756867  Y  beta


Key1 = Z, Key2 = alpha
   dataset1  dataset2 k1     k2
4 -0.010357  1.120745  Z  alpha

In [18]:
dict(list(dframe.groupby('k1')))

{'X':    dataset1  dataset2 k1     k2
 0  0.321673  0.003226  X  alpha
 1 -0.324661 -0.424520  X   beta, 'Y':    dataset1  dataset2 k1     k2
 2  0.061599  0.651864  Y  alpha
 3 -1.138461  0.756867  Y   beta, 'Z':    dataset1  dataset2 k1     k2
 4 -0.010357  1.120745  Z  alpha}

In [19]:
# dtypes will separate by data types and ,...

In [27]:
group_dict = dict(list(dframe.groupby('k1')))
group_dict(columns=['X'],header =None)

TypeError: 'dict' object is not callable

In [28]:
group_dict = dict(list(dframe.groupby('k1')))

In [29]:


group_dict['X']

   dataset1  dataset2 k1     k2
0  0.321673  0.003226  X  alpha
1 -0.324661 -0.424520  X   beta

In [30]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [31]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.321673  0.003226
 1 -0.324661 -0.424520
 2  0.061599  0.651864
 3 -1.138461  0.756867
 4 -0.010357  1.120745, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [34]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [36]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.003226
   beta  -0.424520
Y  alpha  0.651864
   beta   0.756867
Z  alpha  1.120745

# 43 Starts here

In [37]:
animals = DataFrame(np.arange(16).reshape(4,4),
                   columns = ['W','X','Y','Z'],
                   index = ['Dog','Cat','Bird','Mouse'])
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [45]:
animals.loc[1:2,['W','Y']] = np.nan
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    NaN   9   NaN  11
Mouse  12.0  13  14.0  15

In [43]:
# Now .ix = .loc

In [50]:
behaviour_map = {'W':'good','X':'bad','Y':'good','Z':'bad'}
#behaviour_map =  { 'Dog':'good','Cat':'bad','Bird':'good','Mouse':'bad'}
animal_col = animals.groupby(behaviour_map,axis=1)
animal_col.sum()

        bad  good
Dog     4.0   2.0
Cat    12.0   NaN
Bird   20.0   NaN
Mouse  28.0  26.0

In [49]:
#check carefully

In [52]:
b= Series(behaviour_map)
b

W    good
X     bad
Y    good
Z     bad
dtype: object

In [57]:
animals.groupby(len).sum()
#check chars for index names

      W   X     Y   Z
3   0.0   6   2.0  10
4   NaN   9   NaN  11
5  12.0  13  14.0  15

In [63]:
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],
                                       [1,2,3,1,2]],
                                     names=['cities','sub_value'])
d = DataFrame(np.arange(25).reshape(5,5),columns = hier_col)
d=d*100
d

cities       NY                SF
sub_value     1     2     3     1     2
0             0   100   200   300   400
1           500   600   700   800   900
2          1000  1100  1200  1300  1400
3          1500  1600  1700  1800  1900
4          2000  2100  2200  2300  2400